sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe0 0x00u          /*!<@brief Input Buffer Enable: Disables */
#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PCR_PS_ps1 0x01u            /*!<@brief Pull Select: Enables internal pullup resistor */
#define PORT0_PCR0_MUX_mux01 0x01u  /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */
#define PORT0_PCR1_MUX_mux01 0x01u  /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */
#define PORT2_PCR17_MUX_mux10 0x02u /*!<@brief Pin Multiplex Control: Alternative 2 (chip-specific) */
#define PORT2_PCR20_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR21_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR23_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR2_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR4_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR5_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR6_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT0_1 (number 77), SWCLK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SWCLK_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SWCLK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SWCLK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT0_0 (number 76), SWDIO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SWDIO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SWDIO_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SWDIO_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT1_8 (number 1), LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_GPIO_PIN 8U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT3_16 (number 59), RS485_EN2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RS485_EN2_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RS485_EN2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_RS485_EN2_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_RS485_EN2_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RS485_EN2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RS485_EN2_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RS485_EN2_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT2_21 (number 41), ADC_PWR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADC_PWR_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ADC_PWR_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_ADC_PWR_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ADC_PWR_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC_PWR_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC_PWR_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC_PWR_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_20 (number 40), IO7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IO7_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IO7_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_IO7_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IO7_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IO7_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IO7_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IO7_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                     /* @} */

