sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/board/pin_mux.h
/*! @name PORT3_13 (number 62), IO2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IO2_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IO2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_IO2_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IO2_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IO2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IO2_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IO2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT3_12 (number 63), LED_OUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_OUT_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_OUT_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_OUT_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_OUT_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_OUT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_OUT_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_OUT_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_11 (number 66), RESET
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RESET_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RESET_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_RESET_GPIO_PIN 11U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_RESET_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RESET_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RESET_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RESET_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT3_22 (number 53), I2C3_WP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_I2C3_WP_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_I2C3_WP_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_I2C3_WP_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_I2C3_WP_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C3_WP_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C3_WP_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C3_WP_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_23 (number 42), IN4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IN4_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IN4_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IN4_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IN4_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IN4_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IN4_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT2_12 (number 34), SPI1_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI1_SCK_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI1_SCK_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI1_SCK_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT2_13 (number 35), SPI1_MOSI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI1_MOSI_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI1_MOSI_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI1_MOSI_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT2_17 (number 38), SPI1_CS
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI1_CS_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI1_CS_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI1_CS_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_0 (number 91), SPI0_MOSI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI0_MOSI_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI0_MOSI_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI0_MOSI_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT0_2 (number 78), SPI0_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI0_SCK_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI0_SCK_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI0_SCK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_2 (number 93), SPI0_MISO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI0_MISO_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI0_MISO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI0_MISO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

