sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IN1_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IN1_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IN1_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IN1_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IN1_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IN1_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT3_19 (number 56), IN10
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IN10_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IN10_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IN10_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IN10_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IN10_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IN10_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_20 (number 55), IN6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IN6_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IN6_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IN6_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IN6_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IN6_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IN6_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT3_21 (number 54), IN7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IN7_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IN7_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_IN7_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IN7_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IN7_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IN7_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT2_2 (number 24), DAC1_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DAC1_1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DAC1_1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DAC1_1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT0_20 (number 87), UART0_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART0_RX_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART0_RX_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART0_RX_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT0_21 (number 88), UART0_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART0_TX_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART0_TX_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART0_TX_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT0_19 (number 86), RS485_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RS485_EN_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RS485_EN_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_RS485_EN_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_RS485_EN_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RS485_EN_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RS485_EN_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RS485_EN_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_8 (number 69), UART1_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART1_RX_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART1_RX_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART1_RX_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_9 (number 68), UART1_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART1_TX_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART1_TX_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART1_TX_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_0 (number 73), PWM0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWM0_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWM0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWM0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT1_4 (number 97), AD1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD1_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD1_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT1_5 (number 98), AD2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT1_6 (number 99), AD3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD3_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT1_7 (number 100), AD4
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD4_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD4_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD4_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT2_4 (number 26), ADC1_3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC1_3_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC1_3_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC1_3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT2_0 (number 22), AD6
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD6_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD6_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD6_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                    /* @} */

