sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/board/pin_mux.h
/*! @name PORT2_1 (number 23), AD7
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD7_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD7_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD7_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT2_6 (number 28), AD12
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD12_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD12_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD12_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT2_5 (number 27), AD11
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD11_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD11_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD11_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT1_10 (number 3), AD9
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD9_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD9_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD9_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT1_11 (number 4), AD10
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD10_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD10_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD10_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT1_14 (number 7), AD14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD14_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD14_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD14_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT1_15 (number 8), AD13
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD13_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD13_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD13_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT2_3 (number 25), AD8
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AD8_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AD8_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AD8_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
